app/controllers/urls_controller.rb

SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "BeNaUQ"], ["LIMIT", 1]]
UPDATE "urls" SET "visit_count" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["visit_count", 77], ["updated_at", "2019-05-29 21:06:41.092129"], ["id", 6]]
---
  def show
    begin
      url = Url.new
      original_url = url.find_by_short_url(@@DOMAIN_NAME + params[:short_url]).original_url
      url.update_visits(@@DOMAIN_NAME + params[:short_url])

INSERT INTO "urls" ("original_url", "sanitized_url", "short_url", "title", "visit_count", "date_shortened", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "oTiFNQ"], ["LIMIT", 1]]
---
  def create
    # Create de object and set every parameter of a new URL record
    url = Url.new
    url.original_url = params[:original_url]
    if url.valid_url?
      if url.new_url?
        url.generate_short_url(@@DOMAIN_NAME)
        url.title = "Waiting for job trigger..."
        url.visit_count = 0
        url.generate_date_shortened
        url.save
        job = GetUrlTitleJob.new
        job.get_title(url.short_url)
        redirect_to shortened_path(original_url: url.original_url, short_url: url.short_url, title: url.title, visit_count: url.visit_count, date_shortened: url.date_shortened, obs: "New shortened")
      else
        redirect_to shortened_path(original_url: url.original_url, short_url: url.find_duplicate.short_url, title: url.find_duplicate.title, visit_count: url.find_duplicate.visit_count, date_shortened: url.find_duplicate.date_shortened, obs: "Before shortened")