app/models/url.rb

  def generate_short_url(domain_name)
    var = 2
    loop do
      self.short_url = domain_name + (Base64.encode64(self.original_url)[0..var])
      if Url.find_by_short_url(self.short_url).nil?
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "http://localhost:3000/aHR0"], ["LIMIT", 1]]

  def find_duplicate
    Url.find_by_original_url(self.original_url)
---
SELECT  "urls".* FROM "urls" WHERE "urls"."original_url" = ? LIMIT ?  [["original_url", "https://www.debian.org/social_contract"], ["LIMIT", 1]]

  def find_by_short_url(short_url)
    Url.find_by_short_url(short_url)
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "BeNaUQ"], ["LIMIT", 1]]

  def update_visits(short_url)
    url = Url.find_by_short_url(short_url)
    url.visit_count = url.visit_count + 1
    url.save
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "localhost:3000/fjs2KZ"], ["LIMIT", 1]]
UPDATE "urls" SET "visit_count" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["visit_count", 77], ["updated_at", "2019-05-29 21:06:41.092129"], ["id", 6]]

  def top_board
    Url.order(visit_count: :asc).limit(100).reverse
---
SELECT  "urls".* FROM "urls" ORDER BY "urls"."visit_count" ASC LIMIT ?  [["LIMIT", 100]]