app/jobs/get_url_title_job.rb

SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "localhost:3000/a2GYCW"], ["LIMIT", 1]]
UPDATE "urls" SET "title" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["title", "localhost:3000/SlXE7y"], ["updated_at", "2019-05-30 20:36:23.500649"], ["id", 15]]
UPDATE "urls" SET "title" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["title", "Page title unreachable"], ["updated_at", "2019-05-30 20:25:47.840130"], ["id", 4]]
---
  def get_title(short_url)
    begin
	    url = Url.find_by_short_url(short_url)
	    page = MetaInspector.new(url.original_url)
	    url.title = page.title #"MetaInspector test..."
	    url.save
	rescue
		url = Url.find_by_short_url(short_url)
	    url.title = "Page title unreachable"
	    url.save